Autodesk.Revit.DB.DefaultOpenFromCloudCallback.OnOpenConflict(Autodesk.Revit.DB.OpenConflictScenario)
A method called when the conflict is happen during the model opening.
scenario:
The scenario of the conflict.
Returns:
Returns the result to indicate whether to keep the unsynchronized change, or open the latest version or cancel the open action.
Since:
2019

Autodesk.Revit.DB.DefaultOpenFromCloudCallback.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.DefaultOpenFromCloudCallback.#ctor
Create a default open callback. Open latest by default for all scenarios.
Since:
2019

Autodesk.Revit.DB.DefaultOpenFromCloudCallback
A default callback that may be used to control Revit's behavior when opening a model.
Since:
2019